In [3]:
import pandas as pd

In [4]:
# Defining a dataframe
dict1 = {
    'Name':['Rahul', 'Rohan', 'Vedant', 'Neha', 'Sky', 'Lyon', 'Jota'],
    'Marks':[98,89,99,87,90,83,99],
    'Gender':['Male', 'Male', 'Male', 'Female', 'Male', 'Female', 'Male']
}

df = pd.DataFrame(dict1)
df

     Name  Marks  Gender
0   Rahul     98    Male
1   Rohan     89    Male
2  Vedant     99    Male
3    Neha     87  Female
4     Sky     90    Male
5    Lyon     83  Female
6    Jota     99    Male

In [5]:
# prints head
df.head(5)

     Name  Marks  Gender
0   Rahul     98    Male
1   Rohan     89    Male
2  Vedant     99    Male
3    Neha     87  Female
4     Sky     90    Male

In [6]:
# prints tail
df.tail(5)

     Name  Marks  Gender
2  Vedant     99    Male
3    Neha     87  Female
4     Sky     90    Male
5    Lyon     83  Female
6    Jota     99    Male

In [7]:
# tells about the shape
df.shape

(7, 3)

In [8]:
# info if data
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

In [9]:
# checks for null values
df.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [10]:
# total number of null values
df.isnull().sum() # can be 0 or 1

Name      0
Marks     0
Gender    0
dtype: int64

In [12]:
# statistical values
df.describe() # (include='all')

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [13]:
# get unique values from a dataset
df['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [14]:
# get number of unique values
df['Gender'].nunique()

2

In [15]:
# counts in each case
df['Gender'].value_counts()

Male      5
Female    2
Name: Gender, dtype: int64

In [16]:
# returns the boolean value
df['Marks']>=90

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [21]:
# checks for condition and returns a df
df[df['Marks']>=90]
sum(df['Marks'].between(90,100))

4

In [22]:
# finding average of a dataframe
df['Marks'].mean()

92.14285714285714

In [23]:
def divide_2(x):
    return x/2

df['Marks'].apply(divide_2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [30]:
# adding a new column
df['half'] = df['Marks'].apply(divide_2)

In [31]:
df

     Name  Marks  Gender  half
0   Rahul     98    Male  49.0
1   Rohan     89    Male  44.5
2  Vedant     99    Male  49.5
3    Neha     87  Female  43.5
4     Sky     90    Male  45.0
5    Lyon     83  Female  41.5
6    Jota     99    Male  49.5

In [32]:
# give numerical values to categorical data 
df['Gender'].map({'Male':1,'Female':0})

0    1
1    1
2    1
3    0
4    1
5    0
6    1
Name: Gender, dtype: int64

In [33]:
# dropping columns
df.drop(['half'],axis=1,inplace=True)

In [34]:
df

     Name  Marks  Gender
0   Rahul     98    Male
1   Rohan     89    Male
2  Vedant     99    Male
3    Neha     87  Female
4     Sky     90    Male
5    Lyon     83  Female
6    Jota     99    Male

In [35]:
# print names of columns
df.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [36]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [37]:
# sorting a dataframe
df.sort_values(by='Marks') # ascending=False

     Name  Marks  Gender
5    Lyon     83  Female
3    Neha     87  Female
1   Rohan     89    Male
4     Sky     90    Male
0   Rahul     98    Male
2  Vedant     99    Male
6    Jota     99    Male